{
  "result": [
    {
      "url": "https://www.wipro.com/",
      "title": "Software Developer for HSBC (Contract) . Wipro, London UK",
      "date": "July 2025 - Nov 2025",
      "skills": ["Node.JS","Ansible","Vault", "Angular"],
      "description": "Capitalise on blend of technical and analytical competencies to contribute to complex software development initiatives within HSBC’s infrastructure environment. Boost DevOps efficiency by collaborating with Ansible automation team to integrate credential retrieval seamlessly into automated workflows. Advance overall cross-team productivity through joint development efforts with application and automation teams to streamline secure data access processes."
    },
    {
      "url": "https://www.ey.com/",
      "title": "Senior Software Developer . Ernst & Young Mtel, Hong Kong",
      "date": "Oct 2022 - Feb 2025",
      "skills": [],
      "description": "Delivered backend and API development across multiple enterprise projects. Engineered and deployed scalable backend architecture for over 10 projects using Node.js (Typescript, JS) frameworks and PHP frameworks, facilitating seamless functionality and system reliability.Architected APIs, database schemas, and workflows to address bottlenecks and optimise throughput. Implemented CMS platforms and custom APIs, advancing content efficiency and improving end-user accessibility. Elevated team-wide code quality by\nadvocating for clean coding standards and collaborative development, while providing technical guidance to junior team members on complex implementations."
    },
    {
      "url": "https://www.ey.com/",
      "title": "Software Developer . Ernst & Young Mtel, Hong Kong",
      "date": "Aug 2018 - Oct 2022",
      "skills": ["Node.JS", "PHP", "HTML", "Jquery", "Javascript","Typescript", "Java","Kotlin", "Python", "CSS","GraphQL","MySQL","MongoDB"],
      "description": "Delivered full-stack and backend solutions across diverse client projects, applying strong technical acumen and secure development practices. Utilised Docker for application testing, packaging, and deployment, with key focus on ensuring consistency and reducing environment-related issues. Partnered with project managers, UX designers, developers, and QA teams to deliver tailored solutions."
    }
  ]
}
